Show / Hide Table of Contents
Class Member
Member identification
Inheritance
System.Object
Member
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class Member
Constructors
Improve this Doc   View Source
Member()
Constructor
Declaration
public Member()
Improve this Doc   View Source
Member(MemberType, Int32)
Constructor
Declaration
public Member(MemberType memberType, int id)
Parameters
 Type |  Name |  Description
 MemberType |  memberType
Type of member
 System.Int32 |  id
Id of member
Properties
Improve this Doc   View Source
Id
Id of member
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MemberType
Type of member
Declaration
public MemberType MemberType { get; set; }
Property Value
 Type |  Description
 MemberType
 Improve this Doc
 View Source